package com.training.unit02.main;

public class Task01 {

	public static void main(String[] args) {
		//вывести текст на экран

		System.out.println("	Пройдет много лет, и полковник Аурелиано Буэндиа, стоя у стены в ожидании расстрела, вспомнит"
				+ "\n тот далекий вечер, когда отец взял его с собой посмотреть на лед. Макондо было тогда небольшим"
				+ "\n селением с двумя десятками хижин, выстроенных из глины и бамбука на берегу реки, которая мчала"
				+ "\n свои прозрачные воды ...");
		
	}

}
